---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConnectorInsideDiameter
source: html/0ad9d0e8-7333-7395-c65b-f43b703a5695.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConnectorInsideDiameter Property

"Inside Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId ConnectorInsideDiameter { get; }
```